In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("salario.csv")

In [3]:
print("Formato do DataFrame: ", df.shape)

Formato do DataFrame:  (31101, 8)

In [4]:
df.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,122568.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,110796.0,NaN
2,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,122112.0,NaN
3,"ABARCA, EMMANUEL",CONCRETE LABORER,TRANSPORTN,F,Hourly,40.0,NaN,45.9
4,"ABARCA, FRANCES J",POLICE OFFICER,POLICE,F,Salary,NaN,86730.0,NaN

In [5]:
df_police = df[df.Department == "POLICE"].copy()

In [6]:
print("Formato do DataFrame: ", df_police.shape)

Formato do DataFrame:  (12537, 8)

In [7]:
df_police.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,122568.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,110796.0,NaN
4,"ABARCA, FRANCES J",POLICE OFFICER,POLICE,F,Salary,NaN,86730.0,NaN
7,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,109236.0,NaN
9,"ABBOTT, CARMELLA",POLICE OFFICER,POLICE,F,Salary,NaN,90990.0,NaN

In [8]:
df_police.columns.values

array(['Name', 'Job Titles', 'Department', 'Full or Part-Time',
       'Salary or Hourly', 'Typical Hours', 'Annual Salary',
       'Hourly Rate'], dtype=object)

In [9]:
df_police.columns = ['Name', 'Titles', 'Department', 'Full or Part-Time','Salary or Hourly', 'Typical Hours', 'Annual Salary','Hourly Rate']

In [10]:
df_police.columns.values

array(['Name', 'Titles', 'Department', 'Full or Part-Time',
       'Salary or Hourly', 'Typical Hours', 'Annual Salary',
       'Hourly Rate'], dtype=object)

In [11]:
print("--> POLICE:")
display(df_police.isnull().sum())

print("\n", "--." * 10, "\n")

--> POLICE:

Name                     0
Titles                   0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        12528
Annual Salary            9
Hourly Rate          12528
dtype: int64

 --.--.--.--.--.--.--.--.--.--.

In [12]:
df_police = df_police[df_police['Annual Salary'].notna()]

In [13]:
print("--> POLICE:")
display(df_police.isnull().sum())

print("\n", "--." * 10, "\n")

--> POLICE:

Name                     0
Titles                   0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        12528
Annual Salary            0
Hourly Rate          12528
dtype: int64

 --.--.--.--.--.--.--.--.--.--.

In [14]:
jobxx = df_police.Titles.unique()
print("Número de cargos: ",len(jobxx))

Número de cargos:  96

In [23]:
df_police.groupby('Titles')[['Annual Salary']].sum()

                                 Annual Salary
Titles
ACCOUNTANT                            281064.0
ADMINISTRATIVE ASST II                364176.0
ADMINISTRATIVE ASST III               280980.0
AREA COORD - CAPS                     269040.0
ASSOCIATE STAFF ATTORNEY               64896.0
...                                        ...
SUPERINTENDENT'S CHIEF OF STAFF       189252.0
SUPERVISING PROPERTY CUSTODIAN        170688.0
TRAINING OFFICER                     1284672.0
WARRANT AND EXTRADITION AIDE          506316.0
YOUTH SERVICES COORD                  302676.0

[96 rows x 1 columns]

In [ ]:
jobxx = df_police.Titles.unique()
salary_police_mean = df_police.groupby('Titles')['Annual Salary'].mean()
ax = sns.barplot(x=jobxx, y=salary_police_mean)
plt.xticks(rotation=90)
plt.legend(title="Average Pay")
plt.show()

In [ ]:
msalary = df_police['Annual Salary'].mean()
maxsalary = df_police['Annual Salary'].max()
minsalary = df_police['Annual Salary'].min()
print("Média de salário: ", msalary, "Máximo de salário: " , maxsalary, "Mínimo de salário: ", minsalary)

In [ ]:
salary_police_mean = df_police.groupby('Titles')['Annual Salary'].mean()
ax = sns.barplot(x=jobxx, y=salary_police_mean)
plt.xticks(rotation=90)
plt.legend(title="Average Pay")
plt.show()